In [1]:
import pandas as pd

In [2]:
pd.__version__

'2.0.3'

## Data types:
#### - Series 
#### - Dataframe

----

# Introduction to Series
- Series is one dimensional

In [3]:
vowel = ['a','e','i','o','u']
s = pd.Series(vowel)

In [4]:
s

0    a
1    e
2    i
3    o
4    u
dtype: object

In [5]:
type(s)

pandas.core.series.Series

In [6]:
s.index

RangeIndex(start=0, stop=5, step=1)

In [8]:
s.index.tolist()

[0, 1, 2, 3, 4]

In [9]:
s.values

array(['a', 'e', 'i', 'o', 'u'], dtype=object)

In [10]:
s[2]

'i'

In [11]:
s.values[2]

'i'

In [12]:
s[3]

'o'

In [13]:
s.values[3]

'o'

In [14]:
vowel = ['a','e','i','o','u']
s = pd.Series(vowel,index=[101,102,103,104,105])
s

101    a
102    e
103    i
104    o
105    u
dtype: object

In [15]:
s[103]

'i'

In [17]:
s.values[2]

'i'

In [19]:
s=pd.Series(['Hanuman','Ram','Krishna','Ganesh'],name="GodsName")
s

0    Hanuman
1        Ram
2    Krishna
3     Ganesh
Name: GodsName, dtype: object

In [20]:
s1 = pd.Series(['Hanuman', 'Ram', 'Krishna', 'Ganesh'], name="GodsName")
s2 = pd.Series(['3', '4', '2', '1'], name="Position")

In [22]:
df = pd.concat([s1, s2], axis='columns')
df

  GodsName Position
0  Hanuman        3
1      Ram        4
2  Krishna        2
3   Ganesh        1

In [23]:
type(df)

pandas.core.frame.DataFrame

In [24]:
df.shape

(4, 2)

In [25]:
df.ndim

2

### Loading data from a CSV file

In [26]:
df = pd.read_csv("./penguins.csv")

In [32]:
df

,species,island,bill_length_mm,bill_depth_mm,flipper_length_mm,body_mass_g,sex
0,Adelie,Torgersen,39.1,18.7,181.0,3750.0,MALE
1,Adelie,Torgersen,39.5,17.4,186.0,3800.0,FEMALE
2,Adelie,Torgersen,40.3,18.0,195.0,3250.0,FEMALE
3,Adelie,Torgersen,NaN,NaN,NaN,NaN,NaN
4,Adelie,Torgersen,36.7,19.3,193.0,3450.0,FEMALE
...,...,...,...,...,...,...,...
339,Gentoo,Biscoe,NaN,NaN,NaN,NaN,NaN
340,Gentoo,Biscoe,46.8,14.3,215.0,4850.0,FEMALE
341,Gentoo,Biscoe,50.4,15.7,222.0,5750.0,MALE
342,Gentoo,Biscoe,45.2,14.8,212.0,5200.0,FEMALE
343,Gentoo,Biscoe,49.9,16.1,213.0,5400.0,MALE

In [34]:
df.shape

(344, 7)

In [35]:
df.columns.tolist()

['species',
 'island',
 'bill_length_mm',
 'bill_depth_mm',
 'flipper_length_mm',
 'body_mass_g',
 'sex']

In [36]:
df.head()

,species,island,bill_length_mm,bill_depth_mm,flipper_length_mm,body_mass_g,sex
0,Adelie,Torgersen,39.1,18.7,181.0,3750.0,MALE
1,Adelie,Torgersen,39.5,17.4,186.0,3800.0,FEMALE
2,Adelie,Torgersen,40.3,18.0,195.0,3250.0,FEMALE
3,Adelie,Torgersen,NaN,NaN,NaN,NaN,NaN
4,Adelie,Torgersen,36.7,19.3,193.0,3450.0,FEMALE

In [38]:
df.head() #preview first 5 rows

,species,island,bill_length_mm,bill_depth_mm,flipper_length_mm,body_mass_g,sex
0,Adelie,Torgersen,39.1,18.7,181.0,3750.0,MALE
1,Adelie,Torgersen,39.5,17.4,186.0,3800.0,FEMALE
2,Adelie,Torgersen,40.3,18.0,195.0,3250.0,FEMALE
3,Adelie,Torgersen,NaN,NaN,NaN,NaN,NaN
4,Adelie,Torgersen,36.7,19.3,193.0,3450.0,FEMALE

In [39]:
df.tail() #preview last 5 rows

,species,island,bill_length_mm,bill_depth_mm,flipper_length_mm,body_mass_g,sex
339,Gentoo,Biscoe,NaN,NaN,NaN,NaN,NaN
340,Gentoo,Biscoe,46.8,14.3,215.0,4850.0,FEMALE
341,Gentoo,Biscoe,50.4,15.7,222.0,5750.0,MALE
342,Gentoo,Biscoe,45.2,14.8,212.0,5200.0,FEMALE
343,Gentoo,Biscoe,49.9,16.1,213.0,5400.0,MALE

In [42]:
df.sample(3)   #get random rows

,species,island,bill_length_mm,bill_depth_mm,flipper_length_mm,body_mass_g,sex
124,Adelie,Torgersen,35.2,15.9,186.0,3050.0,FEMALE
218,Chinstrap,Dream,50.8,19.0,210.0,4100.0,MALE
296,Gentoo,Biscoe,47.5,14.2,209.0,4600.0,FEMALE

In [44]:
df.sample(3,random_state=2024)  #seeding

,species,island,bill_length_mm,bill_depth_mm,flipper_length_mm,body_mass_g,sex
161,Chinstrap,Dream,51.3,19.9,198.0,3700.0,MALE
318,Gentoo,Biscoe,48.4,14.4,203.0,4625.0,FEMALE
85,Adelie,Dream,41.3,20.3,194.0,3550.0,MALE

### Data profiling and

In [45]:
df.describe()

       bill_length_mm  bill_depth_mm  flipper_length_mm  body_mass_g
count      342.000000     342.000000         342.000000   342.000000
mean        43.921930      17.151170         200.915205  4201.754386
std          5.459584       1.974793          14.061714   801.954536
min         32.100000      13.100000         172.000000  2700.000000
25%         39.225000      15.600000         190.000000  3550.000000
50%         44.450000      17.300000         197.000000  4050.000000
75%         48.500000      18.700000         213.000000  4750.000000
max         59.600000      21.500000         231.000000  6300.000000

In [46]:
df.describe(include = "object")

       species  island   sex
count      344     344   333
unique       3       3     2
top     Adelie  Biscoe  MALE
freq       152     168   168

----
- ##### Displaying unique values in a column

In [50]:
df['species']  # accessing column of dataframe, returns a Series, Series = single column

0      Adelie
1      Adelie
2      Adelie
3      Adelie
4      Adelie
        ...
339    Gentoo
340    Gentoo
341    Gentoo
342    Gentoo
343    Gentoo
Name: species, Length: 344, dtype: object

In [51]:
type(df['species'])

pandas.core.series.Series

In [53]:
df['species'].unique()   #unique values in the species column

array(['Adelie', 'Chinstrap', 'Gentoo'], dtype=object)

In [54]:
df['species'].nunique()    #number of unique values in the species column

3

In [58]:
df['species'].value_counts() #finding frequency of each vlaues in species

species
Adelie       152
Gentoo       124
Chinstrap     68
Name: count, dtype: int64

In [61]:
df.island.unique()    #another way of finding the unique values

array(['Torgersen', 'Biscoe', 'Dream'], dtype=object)

In [60]:
df.island.value_counts()

island
Biscoe       168
Dream        124
Torgersen     52
Name: count, dtype: int64

In [63]:
df['sex'].unique()

array(['MALE', 'FEMALE', nan], dtype=object)

In [66]:
# Sorting values by body_mass_g in ascending order
df.sort_values(by=['body_mass_g'])

,species,island,bill_length_mm,bill_depth_mm,flipper_length_mm,body_mass_g,sex
190,Chinstrap,Dream,46.9,16.6,192.0,2700.0,FEMALE
64,Adelie,Biscoe,36.4,17.1,184.0,2850.0,FEMALE
58,Adelie,Biscoe,36.5,16.6,181.0,2850.0,FEMALE
116,Adelie,Torgersen,38.6,17.0,188.0,2900.0,FEMALE
98,Adelie,Dream,33.1,16.1,178.0,2900.0,FEMALE
...,...,...,...,...,...,...,...
337,Gentoo,Biscoe,48.8,16.2,222.0,6000.0,MALE
253,Gentoo,Biscoe,59.6,17.0,230.0,6050.0,MALE
237,Gentoo,Biscoe,49.2,15.2,221.0,6300.0,MALE
3,Adelie,Torgersen,NaN,NaN,NaN,NaN,NaN
339,Gentoo,Biscoe,NaN,NaN,NaN,NaN,NaN

In [67]:
# Sorting values by body_mass_g in ascending order
df.sort_values(by=['body_mass_g'],ascending=False)

,species,island,bill_length_mm,bill_depth_mm,flipper_length_mm,body_mass_g,sex
237,Gentoo,Biscoe,49.2,15.2,221.0,6300.0,MALE
253,Gentoo,Biscoe,59.6,17.0,230.0,6050.0,MALE
297,Gentoo,Biscoe,51.1,16.3,220.0,6000.0,MALE
337,Gentoo,Biscoe,48.8,16.2,222.0,6000.0,MALE
331,Gentoo,Biscoe,49.8,15.9,229.0,5950.0,MALE
...,...,...,...,...,...,...,...
58,Adelie,Biscoe,36.5,16.6,181.0,2850.0,FEMALE
64,Adelie,Biscoe,36.4,17.1,184.0,2850.0,FEMALE
190,Chinstrap,Dream,46.9,16.6,192.0,2700.0,FEMALE
3,Adelie,Torgersen,NaN,NaN,NaN,NaN,NaN
339,Gentoo,Biscoe,NaN,NaN,NaN,NaN,NaN

In [71]:
# checking which rows contains the male
df['sex'] == "MALE"

0       True
1      False
2      False
3      False
4      False
       ...
339    False
340    False
341     True
342    False
343     True
Name: sex, Length: 344, dtype: bool

In [72]:
#Slices a data depending in a condition
df.loc[df['sex'] == "MALE"]

,species,island,bill_length_mm,bill_depth_mm,flipper_length_mm,body_mass_g,sex
0,Adelie,Torgersen,39.1,18.7,181.0,3750.0,MALE
5,Adelie,Torgersen,39.3,20.6,190.0,3650.0,MALE
7,Adelie,Torgersen,39.2,19.6,195.0,4675.0,MALE
13,Adelie,Torgersen,38.6,21.2,191.0,3800.0,MALE
14,Adelie,Torgersen,34.6,21.1,198.0,4400.0,MALE
...,...,...,...,...,...,...,...
333,Gentoo,Biscoe,51.5,16.3,230.0,5500.0,MALE
335,Gentoo,Biscoe,55.1,16.0,230.0,5850.0,MALE
337,Gentoo,Biscoe,48.8,16.2,222.0,6000.0,MALE
341,Gentoo,Biscoe,50.4,15.7,222.0,5750.0,MALE
343,Gentoo,Biscoe,49.9,16.1,213.0,5400.0,MALE

In [73]:
df.loc[df['sex'] == "FEMALE"]

,species,island,bill_length_mm,bill_depth_mm,flipper_length_mm,body_mass_g,sex
1,Adelie,Torgersen,39.5,17.4,186.0,3800.0,FEMALE
2,Adelie,Torgersen,40.3,18.0,195.0,3250.0,FEMALE
4,Adelie,Torgersen,36.7,19.3,193.0,3450.0,FEMALE
6,Adelie,Torgersen,38.9,17.8,181.0,3625.0,FEMALE
12,Adelie,Torgersen,41.1,17.6,182.0,3200.0,FEMALE
...,...,...,...,...,...,...,...
332,Gentoo,Biscoe,43.5,15.2,213.0,4650.0,FEMALE
334,Gentoo,Biscoe,46.2,14.1,217.0,4375.0,FEMALE
338,Gentoo,Biscoe,47.2,13.7,214.0,4925.0,FEMALE
340,Gentoo,Biscoe,46.8,14.3,215.0,4850.0,FEMALE
342,Gentoo,Biscoe,45.2,14.8,212.0,5200.0,FEMALE

In [74]:
#finding mean of the body mass of female
df.loc[df['sex'] == "FEMALE"]['body_mass_g'].mean()

3862.2727272727275

In [75]:
#finding mean of the body mass of male
df.loc[df['sex'] == "MALE"]['body_mass_g'].mean()

4545.684523809524

In [79]:
#finding mean of the flipper length of female
df.loc[df['sex'] == "FEMALE"]['flipper_length_mm'].mean()

197.36363636363637

In [80]:
#finding mean of the flipper length of male
df.loc[df['sex'] == "MALE"]['flipper_length_mm'].mean()

204.50595238095238

In [81]:
# groups the data in the basis provided groups and finds the average 
df.groupby(['sex'])['flipper_length_mm'].mean()

sex
FEMALE    197.363636
MALE      204.505952
Name: flipper_length_mm, dtype: float64

In [88]:
#species ko adhar ma on average kasko flipperlength lamo xa
df.groupby(['species'])['flipper_length_mm'].mean()

species
Adelie       189.953642
Chinstrap    195.823529
Gentoo       217.186992
Name: flipper_length_mm, dtype: float64

In [90]:
#we can group by with different category
df.groupby(['species','sex'])['flipper_length_mm'].mean()

species    sex
Adelie     FEMALE    187.794521
           MALE      192.410959
Chinstrap  FEMALE    191.735294
           MALE      199.911765
Gentoo     FEMALE    212.706897
           MALE      221.540984
Name: flipper_length_mm, dtype: float64

## Loc vs Iloc

In [92]:
df.sample()

,species,island,bill_length_mm,bill_depth_mm,flipper_length_mm,body_mass_g,sex
250,Gentoo,Biscoe,47.3,15.3,222.0,5250.0,MALE

In [93]:
df.sample(3)

,species,island,bill_length_mm,bill_depth_mm,flipper_length_mm,body_mass_g,sex
48,Adelie,Dream,36.0,17.9,190.0,3450.0,FEMALE
317,Gentoo,Biscoe,46.9,14.6,222.0,4875.0,FEMALE
159,Chinstrap,Dream,51.3,18.2,197.0,3750.0,MALE

In [95]:
## Loc is location so 30 is also included.
df.loc[25:30,['species','island']]

   species  island
25  Adelie  Biscoe
26  Adelie  Biscoe
27  Adelie  Biscoe
28  Adelie  Biscoe
29  Adelie  Biscoe
30  Adelie   Dream

In [ ]:
df.loc[25:30,:2]
# loc ma column ko thau man column name list ma diney ho, index dina paudaina

### iloc

In [98]:
df.iloc[25:30,:2]

   species  island
25  Adelie  Biscoe
26  Adelie  Biscoe
27  Adelie  Biscoe
28  Adelie  Biscoe
29  Adelie  Biscoe

In [ ]:
df.iloc[25:30,['species','island']]
# iloc ma coulumn ko index diney ho name dina puadaina

#### flipper_length_mm >200

In [100]:
df.loc[df['flipper_length_mm'] >= 200]

,species,island,bill_length_mm,bill_depth_mm,flipper_length_mm,body_mass_g,sex
53,Adelie,Biscoe,42.0,19.5,200.0,4050.0,MALE
90,Adelie,Dream,35.7,18.0,202.0,3550.0,FEMALE
91,Adelie,Dream,41.1,18.1,205.0,4300.0,MALE
95,Adelie,Dream,40.8,18.9,208.0,4300.0,MALE
101,Adelie,Biscoe,41.0,20.0,203.0,4725.0,MALE
...,...,...,...,...,...,...,...
338,Gentoo,Biscoe,47.2,13.7,214.0,4925.0,FEMALE
340,Gentoo,Biscoe,46.8,14.3,215.0,4850.0,FEMALE
341,Gentoo,Biscoe,50.4,15.7,222.0,5750.0,MALE
342,Gentoo,Biscoe,45.2,14.8,212.0,5200.0,FEMALE
343,Gentoo,Biscoe,49.9,16.1,213.0,5400.0,MALE

## Assignment
> - ### tips.csv download from https://github.com/mwaskom/seaborn-data/blob/master/tips.csv
> ### practice with this csv file